[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:115:41
         // And the octave bounday is at C, not A.
 
         // Convert frequencies here.
-        if (typeof note === "number" || typeof note == "object") {
+        if (typeof note === "number" || false) {
             const pitchObj = ["''", "'''"]
             // frequencyToPitch(note);
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: TypeError: note.replace is not a function

[Killed] StringLiteral
Harish/testing/src/lilypond.js:116:37
 
         // Convert frequencies here.
         if (typeof note === "number" || typeof note == "object") {
-            const pitchObj = ["''", "'''"]
+            const pitchObj = ["''", ""]
             // frequencyToPitch(note);
             note = pitchObj[0] + pitchObj[1];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note '' '' ''>2.. \staccato < note '' '' ''>2.. \staccato < note '' '' ''>2.. \staccato

[Killed] StringLiteral
Harish/testing/src/lilypond.js:122:28
         }
 
         return note
-            .replace(/♮/g, "!")
+            .replace(/♮/g, "")
             .replace(/♯/g, "is")
             .replace(/♭/g, "es")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:127:28
             .replace(/♭/g, "es")
             .replace(/10/g, "''''''''")
             .replace(/1/g, ",, ")
-            .replace(/2/g, ", ")
+            .replace(/2/g, "")
             .replace(/3/g, "")
             .replace(/4/g, "'")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:129:28
             .replace(/1/g, ",, ")
             .replace(/2/g, ", ")
             .replace(/3/g, "")
-            .replace(/4/g, "'")
+            .replace(/4/g, "")
             .replace(/5/g, "''")
             .replace(/6/g, "'''")
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ ~~~~~_\markup {} } ~~~~~} ~~~}

[Timeout] ConditionalExpression
Harish/testing/src/lilypond.js:143:16
         let k = 0;
         let ii;
 
-        while (k < count) {
+        while (false) {
             tupletDuration = getTupletDuration();
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:148:17
             // logo.notation.notationStaging[turtle][i + j][NOTATIONDURATION];
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
-            if (typeof notes === "object") {
+            if (true) {
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:149:21
 
             // notes = logo.notation.notationStaging[turtle][i + j][NOTATIONNOTE];
             if (typeof notes === "object") {
-                if (notes.length > 1) {
+                if (notes.length <= 1) {
                     logo.notationNotes[turtle] += "<";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:152:30
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
                 }
-                for (ii = 0; ii < notes.length; ii++) {
+                for (ii = 0; ii <= notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                     if (notes.length === 1 || ii < notes.length - 1) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:152:30
                 if (notes.length > 1) {
                     logo.notationNotes[turtle] += "<";
                 }
-                for (ii = 0; ii < notes.length; ii++) {
+                for (ii = 0; ii >= notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                     if (notes.length === 1 || ii < notes.length - 1) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:154:52
                 }
                 for (ii = 0; ii < notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                    if (notes.length === 1 || ii < notes.length - 1) {
+                    if (notes.length === 1 || ii < notes.length + 1) {
                         logo.notationNotes[turtle] += " ";
                     }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] BlockStatement
Harish/testing/src/lilypond.js:154:70
                 }
                 for (ii = 0; ii < notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                    if (notes.length === 1 || ii < notes.length - 1) {
-                        logo.notationNotes[turtle] += " ";
-                    }
+                    if (notes.length === 1 || ii < notes.length - 1) {}
                 }
                 if (notes[6]) {
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] StringLiteral
Harish/testing/src/lilypond.js:155:55
                 for (ii = 0; ii < notes.length; ii++) {
                     logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                     if (notes.length === 1 || ii < notes.length - 1) {
-                        logo.notationNotes[turtle] += " ";
+                        logo.notationNotes[turtle] += "";
                     }
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:158:21
                         logo.notationNotes[turtle] += " ";
                     }
                 }
-                if (notes[6]) {
+                if (false) {
                     logo.notationNotes[turtle] += " \\staccato ";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:161:21
                 if (notes[6]) {
                     logo.notationNotes[turtle] += " \\staccato ";
                 }
-                if (notes.length > 1) {
+                if (notes.length >= 1) {
                     logo.notationNotes[turtle] += ">";
                 }
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } ~~~~~_\markup {} } ~~~~~} ~~~} 
+ undefined~~~~~_\markup {} } ~~~~~} ~~~}

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:168:24
                 logo.notationNotes[turtle] += "3"
                 j++; // Jump to next note.
                 k++; // Increment notes in tuplet.
-            } else if (notes === "tie") {
+            } else if (true) {
             // else if (logo.notation.notationStaging[turtle][i + j] === "tie") {
                 logo.notationNotes[turtle] += "~";
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { ~} \tuple 8/1 { ~} \tuple 8/1 { ~}

[Killed] BlockStatement
Harish/testing/src/lilypond.js:179:29
             }
         }
 
-        if (i + j - 1 < 10) {
-            // const nextObj = logo.notation.notationStaging[turtle][i + j];
-            // Workaround to a Lilypond "feature": if a slur
-            // ends on a tuplet, the closing ) must be inside
-            // the closing } of the tuplet. Same for markup.
-            if (nextObj === ")") {
-                logo.notationNotes[turtle] += ")} ";
-                i += 1;
-            } else if (nextObj === "markup") {
-                logo.notationNotes[turtle] +=
-                    "^\\markup { \\abs-fontsize #6 { " +
-                    // logo.notation.notationStaging[turtle][i + j + 1] +
-                    " } } } ";
-                j += 2;
-            } else if (nextObj === "markdown") {
-                logo.notationNotes[turtle] +=
-                    "_\\markup {" 
-                    // + logo.notation.notationStaging[turtle][i + j + 1] 
-                    + "} } ";
-                j += 2;
-            } else {
-                logo.notationNotes[turtle] += "} ";
-            }
-        } else {
+        if (i + j - 1 < 10) {} else {
             logo.notationNotes[turtle] += "} ";
         }
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { \tuple 8/1 { \tuple 8/1 {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:179:13
             }
         }
 
-        if (i + j - 1 < 10) {
+        if (true) {
             // const nextObj = logo.notation.notationStaging[turtle][i + j];
             // Workaround to a Lilypond "feature": if a slur
killedBy: __processTuplet when i + j - 1 < 10 i + j - 1 > 10"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 7

[Killed] BlockStatement
Harish/testing/src/lilypond.js:184:34
             // Workaround to a Lilypond "feature": if a slur
             // ends on a tuplet, the closing ) must be inside
             // the closing } of the tuplet. Same for markup.
-            if (nextObj === ")") {
-                logo.notationNotes[turtle] += ")} ";
-                i += 1;
-            } else if (nextObj === "markup") {
+            if (nextObj === ")") {} else if (nextObj === "markup") {
                 logo.notationNotes[turtle] +=
                     "^\\markup { \\abs-fontsize #6 { " +
killedBy: __processTuplet when i + j - 1 < 10 nextObj === ")"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\meter
)} "
Received: undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:187:24
             if (nextObj === ")") {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
-            } else if (nextObj === "markup") {
+            } else if (nextObj !== "markup") {
                 logo.notationNotes[turtle] +=
                     "^\\markup { \\abs-fontsize #6 { " +
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { ^\markup { \abs-fontsize #6 {  } } }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:187:24
             if (nextObj === ")") {
                 logo.notationNotes[turtle] += ")} ";
                 i += 1;
-            } else if (nextObj === "markup") {
+            } else if (false) {
                 logo.notationNotes[turtle] +=
                     "^\\markup { \\abs-fontsize #6 { " +
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markup"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } 
+ }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:193:24
                     // logo.notation.notationStaging[turtle][i + j + 1] +
                     " } } } ";
                 j += 2;
-            } else if (nextObj === "markdown") {
+            } else if (nextObj !== "markdown") {
                 logo.notationNotes[turtle] +=
                     "_\\markup {" 
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { _\markup {} }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:193:24
                     // logo.notation.notationStaging[turtle][i + j + 1] +
                     " } } } ";
                 j += 2;
-            } else if (nextObj === "markdown") {
+            } else if (false) {
                 logo.notationNotes[turtle] +=
                     "_\\markup {" 
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markdown"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } 
+ }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:197:23
                 logo.notationNotes[turtle] +=
                     "_\\markup {" 
                     // + logo.notation.notationStaging[turtle][i + j + 1] 
-                    + "} } ";
+                    + "";
                 j += 2;
             } else {
killedBy: __processTuplet when i + j - 1 < 10 nextObj === "markdown"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- \meter
- )} ^\markup { \abs-fontsize #6 {  } } } _\markup {} } 
+ undefined_\markup {

[Killed] StringLiteral
Harish/testing/src/lilypond.js:200:47
                     + "} } ";
                 j += 2;
             } else {
-                logo.notationNotes[turtle] += "} ";
+                logo.notationNotes[turtle] += "";
             }
         } else {
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuple 8/1 { \tuple 8/1 { \tuple 8/1 {

[Killed] StringLiteral
Harish/testing/src/lilypond.js:212:17
     function findKeySignature() {
         return "FLAT" + 
                 " " +
-                "SHARP";
+                "";
     }
     function getStringArr() {
killedBy: findKeySignature should return the key signature
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FLAT SHARP"
Received: "FLAT "

[Killed] BlockStatement
Harish/testing/src/lilypond.js:214:29
                 " " +
                 "SHARP";
     }
-    function getStringArr() {
-        return ["0", "1", "2", "3"]
-    }
+    function getStringArr() {}
     function computeCounter(tupletNoteCounter, x) {
         if (x > 5) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'slice' of undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:215:32
                 "SHARP";
     }
     function getStringArr() {
-        return ["0", "1", "2", "3"]
+        return ["0", "1", "2", ""]
     }
     function computeCounter(tupletNoteCounter, x) {
killedBy: getStringArr should return default string array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "0",
    "1",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:218:13
         return ["0", "1", "2", "3"]
     }
     function computeCounter(tupletNoteCounter, x) {
-        if (x > 5) {
+        if (false) {
             f = div(x, 5)
             tupletNoteCounter *= f;
killedBy: computeCounter should calculate correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.6
Received: 2

[Killed] StringLiteral
Harish/testing/src/lilypond.js:233:32
     }
 
     function getScale() {
-        return ["C", "D", "E", "F", "G", "A", "B"];
+        return ["C", "D", "E", "", "G", "A", "B"];
     }
     function getExtendedScale() {
killedBy: findScale should return the scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "C",
    "D",

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:238:27
     function getExtendedScale() {
         scale = getScale()
         l = scale.length;
-        for (var idx = 0; idx < l; idx++) {
+        for (var idx = 0; idx >= l; idx++) {
             scale.push(scale[idx] + "♭")
             scale.push(scale[idx] + "♯")
killedBy: getExtendedScale should return the extended scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  0

@@ -4,20 +4,6 @@
    "E",
    "F",

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:238:27
     function getExtendedScale() {
         scale = getScale()
         l = scale.length;
-        for (var idx = 0; idx < l; idx++) {
+        for (var idx = 0; idx <= l; idx++) {
             scale.push(scale[idx] + "♭")
             scale.push(scale[idx] + "♯")
killedBy: getExtendedScale should return the extended scale
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

@@ -18,6 +18,8 @@
    "G♯",
    "A♭",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:247:29
     function getEmptyString() {
         return "";
     }
-    function getEmptyList() {
-        return [];
-    }
+    function getEmptyList() {}
     function getArr() {
         return [0,0];
killedBy: getEmptyList should return []
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
Harish/testing/src/lilypond.js:251:16
         return [];
     }
     function getArr() {
-        return [0,0];
+        return [];
     }
     function getSong() {
killedBy: getArr should return a default pair
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   0,

[Killed] StringLiteral
Harish/testing/src/lilypond.js:260:42
         return [getScale(), getSong(), "C", "major"]
     }
     function getModeDef(mode) {
-        return "\n" + mode.replace(/ /g, "_") + " = #`(";
+        return "\n" + mode.replace(/ /g, "") + " = #`(";
     }
     function processLilypondNotes(lilypond, logo, turtle, obj, flag, mode, arr=getArr(), word=getEmptyString(), isComplete=true) {
killedBy: findModeDef should return the mode def
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- hi_/_/_hi = #`(
+ hi//hi = #`(

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:281:29
         let notes;
         // print(logo.notation)
         if (flag) {
-            for (let i = 0; i < 3; i++) {
+            for (let i = 0; i >= 3; i++) {
                 // let obj = logo.notation.notationStaging[turtle][i];
                 if (typeof obj === "string") {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

- \meter
- \tempo swing
- \tempo swing

[Killed] StringLiteral
Harish/testing/src/lilypond.js:294:33
                                 "3" +
                                 // logo.notation.notationStaging[turtle][i + 2] +
                                 " = " +
-                                "6" +
+                                "" +
                                 // logo.notation.notationStaging[turtle][i + 1] +
                                 "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tempo 3 = 6
+ \tempo 3 =

[Killed] StringLiteral
Harish/testing/src/lilypond.js:309:33
                             break;
                         case "markdown":
                             logo.notationNotes[turtle] +=
-                                "_\\markup { " + "6"
+                                "" + "6"
                                 // logo.notation.notationStaging[turtle][i + 1] 
                                 + " } ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- _\markup { 6 } _\markup { 6 } 
+ 6 } 6 }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:309:50
                             break;
                         case "markdown":
                             logo.notationNotes[turtle] +=
-                                "_\\markup { " + "6"
+                                "_\\markup { " + ""
                                 // logo.notation.notationStaging[turtle][i + 1] 
                                 + " } ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- _\markup { 6 } _\markup { 6 } 
+ _\markup {  } _\markup {  }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:314:30
                                 + " } ";
                             i += 1;
                             break;
-                        case "break":
+                        case "":
                             if (i > 0) {
                                 logo.notationNotes[turtle] += "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
-
-

[Killed] BlockStatement
Harish/testing/src/lilypond.js:315:40
                             i += 1;
                             break;
                         case "break":
-                            if (i > 0) {
-                                logo.notationNotes[turtle] += "\n";
-                            }
+                            if (i > 0) {}
                             break;
                         case "begin articulation":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 0

  \meter

-

[Killed] StringLiteral
Harish/testing/src/lilypond.js:322:30
                         case "begin articulation":
                             articulation = true;
                             break;
-                        case "end articulation":
+                        case "":
                             articulation = false;
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-
+ end articulationend articulationend articulation

[Killed] StringLiteral
Harish/testing/src/lilypond.js:329:59
                             logo.notationNotes[turtle] += "\\< ";
                             break;
                         case "begin decrescendo":
-                            logo.notationNotes[turtle] += "\\> ";
+                            logo.notationNotes[turtle] += "";
                             break;
                         case "end crescendo":
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \> \> \> 
+

[Killed] StringLiteral
Harish/testing/src/lilypond.js:341:30
                             // The ( is added after the first note.
                             queueSlur = true;
                             break;
-                        case "end slur":
+                        case "":
                             logo.notationNotes[turtle] += ")  ";
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- )  )  )  
+ end slurend slurend slur

[Killed] StringLiteral
Harish/testing/src/lilypond.js:358:42
                             key = "♭𝄪♯♮𝄫"
                                 .toLowerCase()
                                 .replace("♭", "es") // check macro FLAT
-                                .replace("♯", "is")
+                                .replace("", "is")
                                 .replace("♮", "")
                                 .replace("𝄪", "isis")
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key isesisis♯eses \major

[Killed] StringLiteral
Harish/testing/src/lilypond.js:360:42
                                 .replace("♭", "es") // check macro FLAT
                                 .replace("♯", "is")
                                 .replace("♮", "")
-                                .replace("𝄪", "isis")
+                                .replace("" "isis")
                                 .replace("𝄫", "eses");
                             // mode = logo.notation.notationStaging[turtle][i + 2];
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key isises𝄪iseses \major

[Killed] StringLiteral
Harish/testing/src/lilypond.js:361:48
                                 .replace("♯", "is")
                                 .replace("♮", "")
                                 .replace("𝄪", "isis")
-                                .replace("𝄫", "eses");
+                                .replace("𝄫", """;
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key esisisis \major
