[Killed] StringLiteral
Harish/testing/src/lilypond.js:361:42
                                 .replace("♯", "is")
                                 .replace("♮", "")
                                 .replace("𝄪", "isis")
-                                .replace("𝄫", "eses");
+                                .replace("" "eses");
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key esesesisisis𝄫 \major

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:364:33
                                 .replace("𝄫", "eses");
                             // mode = logo.notation.notationStaging[turtle][i + 2];
                             // Lilypond knows about common modes.
-                            if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
+                            if (true)
                             {
                                 logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-  \key esisisiseses \
+ \key esisisiseses \

[Killed] StringLiteral
Harish/testing/src/lilypond.js:366:80
                             // Lilypond knows about common modes.
                             if (["major", "minor", "ionian", "dorian", "phrygian","lydian", "mixolydian","aeolian", "locrian"].indexOf(mode) !== -1)
                             {
-                                logo.notationNotes[turtle] += "\\key " + key + " \\" + mode + "\n";
+                                logo.notationNotes[turtle] += "\\key " + key + "" + mode + "\n";
                             } 
                             else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \key esisisiseses \major
+ \key esisisisesesmajor

[Killed] StringLiteral
Harish/testing/src/lilypond.js:379:33
                                 " \\time " +
                                 "3" + 
                                 // logo.notation.notationStaging[turtle][i + 1] +
-                                "/" + "4" +
+                                "" + "4" +
                                 // logo.notation.notationStaging[turtle][i + 2] +
                                 "\n";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-  \time 3/4
+  \time 34

[Killed] BlockStatement
Harish/testing/src/lilypond.js:390:45
                             i += 1;
                             break;
                         case "voice one":
-                            if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
-                            } else {
+                            if (multivoice) {} else {
                                 logo.notationNotes[turtle] += "<< { \\voiceOne ";
                                 multivoice = true;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:391:63
                             break;
                         case "voice one":
                             if (multivoice) {
-                                logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceOne ";
+                                logo.notationNotes[turtle] += "";
                             } else {
                                 logo.notationNotes[turtle] += "<< { \\voiceOne ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceOne }
- \new Voice { \voiceOne }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:397:30
                                 multivoice = true;
                             }
                             break;
-                        case "voice two":
+                        case "":
                             if (multivoice) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceTwo }
- \new Voice { \voiceTwo }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:398:33
                             }
                             break;
                         case "voice two":
-                            if (multivoice) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceTwo ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- << { \voiceTwo }
+ }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:406:33
                             }
                             break;
                         case "voice three":
-                            if (multivoice) {
+                            if (false) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceThree ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 1

  \meter
- << { \voiceThree }
- \new Voice { \voiceThree }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:414:33
                             }
                             break;
                         case "voice four":
-                            if (multivoice) {
+                            if (true) {
                                 logo.notationNotes[turtle] += "}\n\\new Voice { \\voiceFour ";
                             } else {
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

  \meter
- << { \voiceFour }
+ }

[Killed] StringLiteral
Harish/testing/src/lilypond.js:421:30
                                 multivoice = true;
                             }
                             break;
-                        case "one voice":
+                        case "":
                             logo.notationNotes[turtle] += "}\n>> \\oneVoice\n";
                             break;
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 7
+ Received  + 1

  \meter
- }
- >> \oneVoice

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:429:26
                             break;
                     }
                 } 
-                else if (typeof obj === "number") {
+                else if (typeof obj !== "number") {
                     // logo.notationNotes[turtle] = "gayugayu"
                     throw new Error("Obj should be a string or an array");
killedBy: processLilypondNotes, when typeof obj == string typeof obj[0] === string
statusReason: Error: Obj should be a string or an array

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:453:29
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
                             : -1;
 
-                        if (arr[0] > commonTupletNote) {
+                        if (false) {
                             f = div(arr[0], commonTupletNote)
                             commonTupletNote = arr[0];
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] > 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 12/1 { } \tuple 12/1 { } \tuple 12/1 { } 
+ \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { }

[Killed] BlockStatement
Harish/testing/src/lilypond.js:453:56
                         totalTupletDuration = (isComplete) ? 1 / (2 * 4)
                             : -1;
 
-                        if (arr[0] > commonTupletNote) {
-                            f = div(arr[0], commonTupletNote)
-                            commonTupletNote = arr[0];
-                            tupletNoteCounter *= f;
-                            tupletNoteCounter += 1;
-                        }
+                        if (arr[0] > commonTupletNote) {}
 
                         let j = 1;
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] > 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 12/1 { } \tuple 12/1 { } \tuple 12/1 { } 
+ \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { }

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:462:36
 
                         let j = 1;
                         let k = 1;
-                        while (k < arr[0] * arr[1]) {
+                        while (k < arr[0] / arr[1]) {
                             if (word[3] === "tie") {
                                 // console.debug("saw a tie");
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:462:32
 
                         let j = 1;
                         let k = 1;
-                        while (k < arr[0] * arr[1]) {
+                        while (false) {
                             if (word[3] === "tie") {
                                 // console.debug("saw a tie");
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+ \tuplet 1/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:463:33
                         let j = 1;
                         let k = 1;
                         while (k < arr[0] * arr[1]) {
-                            if (word[3] === "tie") {
+                            if (false) {
                                 // console.debug("saw a tie");
                                 k = increment(k); // Increment notes in tuplet.
killedBy: processLilypondNotes, when typeof obj != string word[3] == tie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:468:38
                                 k = increment(k); // Increment notes in tuplet.
                                 j = increment(j);
                             } 
-                            else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) !== -1) {
+                            else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) === -1) {
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:468:38
                                 k = increment(k); // Increment notes in tuplet.
                                 j = increment(j);
                             } 
-                            else if ([1, 0.5, 0.25, 0.125, 0.0625].indexOf(totalTupletDuration) !== -1) {
+                            else if (true) {
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:472:40
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
                                 break;
-                            } else if (word[3] === null) {
+                            } else if (true) {
                                 incompleteTuplet = j;
                                 break;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:472:40
                                 // Break up tuplet on POW2 values
                                 incompleteTuplet = j;
                                 break;
-                            } else if (word[3] === null) {
+                            } else if (word[3] !== null) {
                                 incompleteTuplet = j;
                                 break;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:476:38
                                 incompleteTuplet = j;
                                 break;
                             } 
-                            else if (word[3][0] !== arr[0]) {
+                            else if (true) {
                                 // Match if sharing same factor, e.g., 1/3, 1/6, 1/12
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:476:38
                                 incompleteTuplet = j;
                                 break;
                             } 
-                            else if (word[3][0] !== arr[0]) {
+                            else if (word[3][0] === arr[0]) {
                                 // Match if sharing same factor, e.g., 1/3, 1/6, 1/12
                                 incompleteTuplet = j;
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuple -2/2 { } \tuple -2/2 { } \tuple -2/2 { }

[Timeout] BlockStatement
Harish/testing/src/lilypond.js:481:34
                                 incompleteTuplet = j;
                                 break;
                             } 
-                            else {
-                                tupletNoteCounter = computeCounter(tupletNoteCounter, word[4])
-                                if (word[4] > 5) { break; }
-                                targetDuration +=
-                                    div(1, word[1]);
-                                tupletDuration +=
-                                    div(1, word[4]);
-                                totalTupletDuration +=
-                                    div(1, (div(word[3][0], div(1, word[3][1]))));
-                                j = increment(j); // Jump to next note.
-                                k = increment(k); // Increment notes in tuplet.
-                                // incompleteTuplet = 0
-                            }
+                            else {}
 
                             // else { 

[Killed] BlockStatement
Harish/testing/src/lilypond.js:483:50
                             } 
                             else {
                                 tupletNoteCounter = computeCounter(tupletNoteCounter, word[4])
-                                if (word[4] > 5) { break; }
+                                if (word[4] > 5) {}
                                 targetDuration +=
                                     div(1, word[1]);
killedBy: processLilypondNotes, when typeof obj != string word[4] > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuplet 1/2 { } 
+ \tuplet 1/1 { }

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:520:25
                 
 
                     if (
-                        arr[0] != null &&
+                        arr[0] == null &&
                         arr[0] * arr[1] > 0
                     ) {
killedBy: processLilypondNotes, when typeof obj != string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- \tuple 8/1 { } \tuple 8/1 { } \tuple 8/1 { } 
+  \staccato  \staccato  \staccato

[Timeout] EqualityOperator
Harish/testing/src/lilypond.js:521:25
 
                     if (
                         arr[0] != null &&
-                        arr[0] * arr[1] > 0
+                        arr[0] * arr[1] >= 0
                     ) {
                         // Lilypond tuplets look like this: \tuplet 3/2 { f8 g a }

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:574:29
                         targetDuration = 0;
                         tupletDuration = 0;
                     } else {
-                        if (typeof notes === "object") {
+                        if (true) {
                             if (notes.length > 1) {
                                 logo.notationNotes[turtle] += "< note ";
killedBy: processLilypondNotes, when typeof obj == string typeof obj[0] === string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
-    
+ < note a b c>def < note a b c>def < note a b c>def

[Killed] StringLiteral
Harish/testing/src/lilypond.js:576:63
                     } else {
                         if (typeof notes === "object") {
                             if (notes.length > 1) {
-                                logo.notationNotes[turtle] += "< note ";
+                                logo.notationNotes[turtle] += "";
                             }
 
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ ''''' ''''' '''''>2.. \staccato ''''' ''''' '''''>2.. \staccato ''''' ''''' '''''>2.. \staccato

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:579:46
                                 logo.notationNotes[turtle] += "< note ";
                             }
 
-                            for (let ii = 0; ii < notes.length; ii++) {
+                            for (let ii = 0; ii >= notes.length; ii++) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
                                 if (ii < notes.length - 1) {
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note >2.. \staccato < note >2.. \staccato < note >2.. \staccato

[Killed] BlockStatement
Harish/testing/src/lilypond.js:579:71
                                 logo.notationNotes[turtle] += "< note ";
                             }
 
-                            for (let ii = 0; ii < notes.length; ii++) {
-                                logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                                if (ii < notes.length - 1) {
-                                    logo.notationNotes[turtle] += " ";
-                                }
-                            }
+                            for (let ii = 0; ii < notes.length; ii++) {}
 
                             if (notes.length > 1) {
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note >2.. \staccato < note >2.. \staccato < note >2.. \staccato

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:581:37
 
                             for (let ii = 0; ii < notes.length; ii++) {
                                 logo.notationNotes[turtle] += __toLilynote(notes[ii]);
-                                if (ii < notes.length - 1) {
+                                if (ii >= notes.length - 1) {
                                     logo.notationNotes[turtle] += " ";
                                 }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''''''''''''' >2.. \staccato < note ''''''''''''''' >2.. \staccato < note ''''''''''''''' >2.. \staccato

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:591:45
                             }
 
                             logo.notationNotes[turtle] += obj[1];
-                            for (let d = 0; d < obj[1]; d++) {
+                            for (let d = 0; d >= obj[1]; d++) {
                                 logo.notationNotes[turtle] += ".";
                             }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato < note ''''' ''''' '''''>2 \staccato

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:591:45
                             }
 
                             logo.notationNotes[turtle] += obj[1];
-                            for (let d = 0; d < obj[1]; d++) {
+                            for (let d = 0; d <= obj[1]; d++) {
                                 logo.notationNotes[turtle] += ".";
                             }
killedBy: processLilypondNotes, when typeof obj != string arr[0] != null, arr[0] * arr[1] <= 0, typeof notes == obj, arr[1] = 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato < note ''''' ''''' '''''>2.. \staccato 
+ < note ''''' ''''' '''''>2... \staccato < note ''''' ''''' '''''>2... \staccato < note ''''' ''''' '''''>2... \staccato

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:606:21
                         tupletDuration = 0;
                     }
                 }
-                if (articulation) {
+                if (false) {
                     logo.notationNotes[turtle] += "->";
                 }
killedBy: processLilypondNotes, when typeof obj == string should set the font size
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  \meter
- ->->->
+

[Killed] BlockStatement
Harish/testing/src/lilypond.js:618:37
         }
     };
 
-    function computeFoundNotes(obj) {
-        let foundNotes = false;
-        if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
-            foundNotes = true;
-        }
-        return foundNotes;
-    }
+    function computeFoundNotes(obj) {}
 
     function funcNum(t){
killedBy: computeFoundNotes when obj[0][0]=="R"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:619:26
     };
 
     function computeFoundNotes(obj) {
-        let foundNotes = false;
+        let foundNotes = true;
         if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
             foundNotes = true;
killedBy: computeFoundNotes when obj[0][0]=="R"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:620:40
 
     function computeFoundNotes(obj) {
         let foundNotes = false;
-        if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
+        if (typeof obj === "object" && false && obj[0][0] !== "R") {
             foundNotes = true;
         }
killedBy: computeFoundNotes when all conditions are met
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:620:13
 
     function computeFoundNotes(obj) {
         let foundNotes = false;
-        if (typeof obj === "object" && typeof obj[0] === "object" && obj[0][0] !== "R") {
+        if (true) {
             foundNotes = true;
         }
killedBy: computeFoundNotes when obj[0][0]=="R"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
Harish/testing/src/lilypond.js:626:24
         return foundNotes;
     }
 
-    function funcNum(t){
-        if (typeof t === "string") {
-            return Number(t);
-        }
-        return t;
-    }
+    function funcNum(t){}
 
     function greaterThan(a,b){
killedBy: funcNum when t is a string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:627:36
     }
 
     function funcNum(t){
-        if (typeof t === "string") {
-            return Number(t);
-        }
+        if (typeof t === "string") {}
         return t;
     }
killedBy: funcNum when t is a string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: "5"

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:627:13
     }
 
     function funcNum(t){
-        if (typeof t === "string") {
+        if (false) {
             return Number(t);
         }
killedBy: funcNum when t is a string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: "5"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:633:30
         return t;
     }
 
-    function greaterThan(a,b){
-        if(a>b){
-            return 1;
-        }
-        return 0;
-    }
+    function greaterThan(a,b){}
 
     function getRodents(){
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "percussion",
+   "treble",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:634:12
     }
 
     function greaterThan(a,b){
-        if(a>b){
+        if(true){
             return 1;
         }
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "bass_8",
+   "percussion",

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:634:12
     }
 
     function greaterThan(a,b){
-        if(a>b){
+        if(a >= b){
             return 1;
         }
killedBy: greaterThan when a is equal than b
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1
