[Killed] BlockStatement
Harish/testing/src/lilypond.js:640:26
         return 0;
     }
 
-    function getRodents(){
-        return [
-            ("mouse"),
-            ("brown rat"),
-            ("mole"),
-            ("chipmunk"),
-            ("red squirrel"),
-            ("guinea pig"),
-            ("capybara"),
-            ("coypu"),
-            ("black rat"),
-            ("grey squirrel"),
-            ("flying squirrel"),
-            ("bat")
-        ];
-    }
+    function getRodents(){}
 
     function getClefs(){
killedBy: get functions getRodents
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["mouse", "brown rat", "mole", "chipmunk", "red squirrel", "guinea pig", "capybara", "coypu", "black rat", "grey squirrel", "flying squirrel", "bat"]
Received: undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:646:14
             ("brown rat"),
             ("mole"),
             ("chipmunk"),
-            ("red squirrel"),
+            (""),
             ("guinea pig"),
             ("capybara"),
killedBy: get functions getRodents
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,11 +1,11 @@
  Array [
    "mouse",

[Killed] StringLiteral
Harish/testing/src/lilypond.js:650:14
             ("guinea pig"),
             ("capybara"),
             ("coypu"),
-            ("black rat"),
+            (""),
             ("grey squirrel"),
             ("flying squirrel"),
killedBy: get functions getRodents
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,10 +5,10 @@
    "chipmunk",
    "red squirrel",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:657:24
         ];
     }
 
-    function getClefs(){
-        return ["treble", "bass", "bass_8", "percussion"];
-    }
+    function getClefs(){}
 
     function getNumberNames(){
killedBy: get functions getClefs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["treble", "bass", "bass_8", "percussion"]
Received: undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:658:45
     }
 
     function getClefs(){
-        return ["treble", "bass", "bass_8", "percussion"];
+        return ["treble", "bass", "bass_8", ""];
     }
 
killedBy: get functions getClefs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "treble",
    "bass",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:661:30
         return ["treble", "bass", "bass_8", "percussion"];
     }
 
-    function getNumberNames(){
-        return [
-            "zero",
-            "one",
-            "two",
-            "three",
-            "four",
-            "five",
-            "six",
-            "seven",
-            "eight",
-            "nine"
-        ];
-    }
+    function getNumberNames(){}
 
     function retEmpty(){
killedBy: get functions getNumberNames
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine"]
Received: undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:670:13
             "four",
             "five",
             "six",
-            "seven",
+            "",
             "eight",
             "nine"
killedBy: get functions getNumberNames
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,9 +4,9 @@
    "two",
    "three",

[Killed] StringLiteral
Harish/testing/src/lilypond.js:672:13
             "six",
             "seven",
             "eight",
-            "nine"
+            ""
         ];
     }
killedBy: get functions getNumberNames
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,7 +6,7 @@
    "four",
    "five",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:676:24
         ];
     }
 
-    function retEmpty(){
-        return "";
-    }
+    function retEmpty(){}
     function replace_instr(instrumentName) {
         instrumentName = instrumentName.replace(/ /g, "").replace(".", "")
killedBy: get empty retEmpty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:677:16
     }
 
     function retEmpty(){
-        return "";
+        return "Stryker was here!";
     }
     function replace_instr(instrumentName) {
killedBy: get empty retEmpty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:679:44
     function retEmpty(){
         return "";
     }
-    function replace_instr(instrumentName) {
-        instrumentName = instrumentName.replace(/ /g, "").replace(".", "")
-        return instrumentName;
-    }
+    function replace_instr(instrumentName) {}
     function combine(instrumentName) {
         return '" \\' +
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'indexOf' of undefined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:680:55
         return "";
     }
     function replace_instr(instrumentName) {
-        instrumentName = instrumentName.replace(/ /g, "").replace(".", "")
+        instrumentName = instrumentName.replace(/ /g, "Stryker was here!").replace(".", "")
         return instrumentName;
     }
killedBy: replace_instr should replace instrumentName correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "///"
Received: "/Stryker was here!/Stryker was here!/"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:683:38
         instrumentName = instrumentName.replace(/ /g, "").replace(".", "")
         return instrumentName;
     }
-    function combine(instrumentName) {
-        return '" \\' +
-                    replace_instr(instrumentName) +
-                "\n";
-    }
+    function combine(instrumentName) {}
 
     function combine2(instrumentName) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Killed] StringLiteral
Harish/testing/src/lilypond.js:686:17
     function combine(instrumentName) {
         return '" \\' +
                     replace_instr(instrumentName) +
-                "\n";
+                "";
     }
 
killedBy: combine should not return Voice
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "
"
Received string:    "\" \\test"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:689:39
                 "\n";
     }
 
-    function combine2(instrumentName) {
-        return "      \\" 
-            + instrumentName
-            + "Voice\n";
-    }
+    function combine2(instrumentName) {}
 
     function helperInstrument(instrumentName, RODENTS, tNumber) {
killedBy: combine2 should return Voice
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:695:65
             + "Voice\n";
     }
 
-    function helperInstrument(instrumentName, RODENTS, tNumber) {
-        if (instrumentName === "") {
-            instrumentName = "mouse";
-        }
-
-        if (instrumentName === "start" || instrumentName === "start drum") {
-            instrumentName = RODENTS[2];
-        } else if (instrumentName == tNumber.toString()) {
-            instrumentName = RODENTS[3];
-        }
-        return instrumentName
-    }
+    function helperInstrument(instrumentName, RODENTS, tNumber) {}
 
     function instrument(t, arr, activity, clef, startDrums, s) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'replace' of undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:696:13
     }
 
     function helperInstrument(instrumentName, RODENTS, tNumber) {
-        if (instrumentName === "") {
+        if (false) {
             instrumentName = "mouse";
         }
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mouse"
Received: ""

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:696:13
     }
 
     function helperInstrument(instrumentName, RODENTS, tNumber) {
-        if (instrumentName === "") {
+        if (instrumentName !== "") {
             instrumentName = "mouse";
         }
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:700:13
             instrumentName = "mouse";
         }
 
-        if (instrumentName === "start" || instrumentName === "start drum") {
+        if (false) {
             instrumentName = RODENTS[2];
         } else if (instrumentName == tNumber.toString()) {
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mole"
Received: "start"

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:700:13
             instrumentName = "mouse";
         }
 
-        if (instrumentName === "start" || instrumentName === "start drum") {
+        if (false || instrumentName === "start drum") {
             instrumentName = RODENTS[2];
         } else if (instrumentName == tNumber.toString()) {
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mole"
Received: "start"

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:702:20
 
         if (instrumentName === "start" || instrumentName === "start drum") {
             instrumentName = RODENTS[2];
-        } else if (instrumentName == tNumber.toString()) {
+        } else if (true) {
             instrumentName = RODENTS[3];
         }
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mouse"
Received: "chipmunk"

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:702:20
 
         if (instrumentName === "start" || instrumentName === "start drum") {
             instrumentName = RODENTS[2];
-        } else if (instrumentName == tNumber.toString()) {
+        } else if (instrumentName != tNumber.toString()) {
             instrumentName = RODENTS[3];
         }
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mouse"
Received: "chipmunk"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:708:64
         return instrumentName
     }
 
-    function instrument(t, arr, activity, clef, startDrums, s) {
-        if (t in arr) {
-            // const turtleNumber = tNumber;
-            instrumentName = computeInstrument(activity, clef, startDrums, s, t);
-        }
-        instrumentName = replace_instr(instrumentName);
-        return instrumentName;
-    }
+    function instrument(t, arr, activity, clef, startDrums, s) {}
 
     function computeInstrument(activity, clef, startDrums, arr, instrumentName="") {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'indexOf' of undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:709:13
     }
 
     function instrument(t, arr, activity, clef, startDrums, s) {
-        if (t in arr) {
+        if (true) {
             // const turtleNumber = tNumber;
             instrumentName = computeInstrument(activity, clef, startDrums, s, t);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 29

[Killed] BlockStatement
Harish/testing/src/lilypond.js:709:23
     }
 
     function instrument(t, arr, activity, clef, startDrums, s) {
-        if (t in arr) {
-            // const turtleNumber = tNumber;
-            instrumentName = computeInstrument(activity, clef, startDrums, s, t);
-        }
+        if (t in arr) {}
         instrumentName = replace_instr(instrumentName);
         return instrumentName;
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: ReferenceError: instrumentName is not defined

[Killed] StringLiteral
Harish/testing/src/lilypond.js:717:80
         return instrumentName;
     }
 
-    function computeInstrument(activity, clef, startDrums, arr, instrumentName="") {
+    function computeInstrument(activity, clef, startDrums, arr, instrumentName="Stryker was here!") {
         let CLEFS = getClefs()
         let RODENTS = getRodents()
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mouse"
Received: "Strykerwashere!"

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:720:25
     function computeInstrument(activity, clef, startDrums, arr, instrumentName="") {
         let CLEFS = getClefs()
         let RODENTS = getRodents()
-        for (let c = 0; c < getClefs().length; c++) {
+        for (let c = 0; c <= getClefs().length; c++) {
             // let instrumentName;
             for (let t in getStringArr().slice(1, 5)) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 22

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:720:25
     function computeInstrument(activity, clef, startDrums, arr, instrumentName="") {
         let CLEFS = getClefs()
         let RODENTS = getRodents()
-        for (let c = 0; c < getClefs().length; c++) {
+        for (let c = 0; false; c++) {
             // let instrumentName;
             for (let t in getStringArr().slice(1, 5)) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:722:55
         let RODENTS = getRodents()
         for (let c = 0; c < getClefs().length; c++) {
             // let instrumentName;
-            for (let t in getStringArr().slice(1, 5)) {
-                let tNumber = funcNum(t);
-                if (clef[tNumber] === CLEFS[c]) {
-                    // if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (greaterThan(tNumber,startDrums-1)) {
-                            instrumentName = "drum";
-                        } else {
-                        
-                            instrumentName = helperInstrument(instrumentName, RODENTS, tNumber)
-                        }
-                        instrumentName = replace_instr(instrumentName);
-                        activity.logo.notationOutput += combine2(instrumentName);
-
-                        activity.logo.notationOutput +=
-                            '         \\context TabVoice = "' +
-                            instrumentName +
-                            combine(instrumentName)
-                        
-                    }
-                // }
-            }
+            for (let t in getStringArr().slice(1, 5)) {}
         }
         return instrumentName
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:724:21
             // let instrumentName;
             for (let t in getStringArr().slice(1, 5)) {
                 let tNumber = funcNum(t);
-                if (clef[tNumber] === CLEFS[c]) {
+                if (false) {
                     // if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (greaterThan(tNumber,startDrums-1)) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:724:21
             // let instrumentName;
             for (let t in getStringArr().slice(1, 5)) {
                 let tNumber = funcNum(t);
-                if (clef[tNumber] === CLEFS[c]) {
+                if (true) {
                     // if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (greaterThan(tNumber,startDrums-1)) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 58

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:726:29
                 let tNumber = funcNum(t);
                 if (clef[tNumber] === CLEFS[c]) {
                     // if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (greaterThan(tNumber,startDrums-1)) {
+                        if (true) {
                             instrumentName = "drum";
                         } else {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:726:49
                 let tNumber = funcNum(t);
                 if (clef[tNumber] === CLEFS[c]) {
                     // if (activity.logo.notation.notationStaging[t].length > 0) {
-                        if (greaterThan(tNumber,startDrums-1)) {
+                        if (greaterThan(tNumber,startDrums + 1)) {
                             instrumentName = "drum";
                         } else {
killedBy: computeInstruments should update act.logo.notationOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "drum"
Received: "chipmunk"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:728:32
                     // if (activity.logo.notation.notationStaging[t].length > 0) {
                         if (greaterThan(tNumber,startDrums-1)) {
                             instrumentName = "drum";
-                        } else {
-                        
-                            instrumentName = helperInstrument(instrumentName, RODENTS, tNumber)
-                        }
+                        } else {}
                         instrumentName = replace_instr(instrumentName);
                         activity.logo.notationOutput += combine2(instrumentName);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:736:29
                         activity.logo.notationOutput += combine2(instrumentName);
 
                         activity.logo.notationOutput +=
-                            '         \\context TabVoice = "' +
-                            instrumentName +
-                            combine(instrumentName)
+                            '         \\context TabVoice = "' + instrumentName - combine(instrumentName)
                         
                     }
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:747:79
         return instrumentName
     }
 
-    function findClef(clef, val=0, tNumber=0, startDrums=0, noteCount=0, flag=true) {
+    function findClef(clef, val=0, tNumber=0, startDrums=0, noteCount=0, flag=false) {
         if (!flag) {
             clef.push(getEmptyString())
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "percussion",
+   "",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:748:13
     }
 
     function findClef(clef, val=0, tNumber=0, startDrums=0, noteCount=0, flag=true) {
-        if (!flag) {
+        if (true) {
             clef.push(getEmptyString())
             return clef;
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "percussion",
+   "",

[Killed] BooleanLiteral
Harish/testing/src/lilypond.js:748:13
     }
 
     function findClef(clef, val=0, tNumber=0, startDrums=0, noteCount=0, flag=true) {
-        if (!flag) {
+        if (flag) {
             clef.push(getEmptyString())
             return clef;
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "percussion",
+   "",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:752:13
             clef.push(getEmptyString())
             return clef;
         }
-        if (greaterThan(tNumber,startDrums - 1)) {
+        if (false) {
             clef.push("percussion");
         } else if (greaterThan(noteCount, 0)) {
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "percussion",
+   "treble",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:752:13
             clef.push(getEmptyString())
             return clef;
         }
-        if (greaterThan(tNumber,startDrums - 1)) {
+        if (true) {
             clef.push("percussion");
         } else if (greaterThan(noteCount, 0)) {
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "bass_8",
+   "percussion",

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:754:20
         }
         if (greaterThan(tNumber,startDrums - 1)) {
             clef.push("percussion");
-        } else if (greaterThan(noteCount, 0)) {
+        } else if (false) {
             // eslint-disable-next-line no-console
             // console.debug(
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "bass_8",
+   "treble",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:754:47
         }
         if (greaterThan(tNumber,startDrums - 1)) {
             clef.push("percussion");
-        } else if (greaterThan(noteCount, 0)) {
-            // eslint-disable-next-line no-console
-            // console.debug(
-            //     octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
-            // );
-            switch (Math.floor(0.5 + val)) {
-                case 0:
-                case 1:
-                case 2:
-                    clef.push("bass_8");
-                    break;
-                case 3:
-                    clef.push("bass");
-                    break;
-                default:
-                    clef.push("treble");
-                    break;
-            }
-        } else {
+        } else if (greaterThan(noteCount, 0)) {} else {
             clef.push("treble");
         }
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "bass_8",
- ]

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:759:32
             // console.debug(
             //     octaveTotal + " " + noteCount + " " + Math.floor(0.5 + octaveTotal / noteCount)
             // );
-            switch (Math.floor(0.5 + val)) {
+            switch (Math.floor(0.5 - val)) {
                 case 0:
                 case 1:
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "bass_8",
+   "treble",

[Killed] StringLiteral
Harish/testing/src/lilypond.js:766:31
                     clef.push("bass_8");
                     break;
                 case 3:
-                    clef.push("bass");
+                    clef.push("");
                     break;
                 default:
killedBy: findClef should return the header
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "bass",
+   "",

[Killed] BlockStatement
Harish/testing/src/lilypond.js:778:28
         return clef
     }
 
-    function get_temparr() {
-        return [[1],[2],[3],[4],[5]]
-    }
+    function get_temparr() {}
 
     function getOctaveTotal(arr) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:782:34
         return [[1],[2],[3],[4],[5]]
     }
 
-    function getOctaveTotal(arr) {
-        let octaveTotal = 0
-        for (let i = 0; i < arr.length; i++) {
-            const obj = arr[i];
-            if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                    } else if (typeof obj[0][ii] === "string") {
-                        octaveTotal += Number(obj[0][ii].substr(-1));
-                    } else {
-                        const pitchObj = toFraction(Number(obj[0][ii]));
-                        octaveTotal += pitchObj[0];
-                    }
-                }
-            }
-        }
-        return octaveTotal;
-    }
+    function getOctaveTotal(arr) {}
 
     function add(a, b) {
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:784:46
 
     function getOctaveTotal(arr) {
         let octaveTotal = 0
-        for (let i = 0; i < arr.length; i++) {
-            const obj = arr[i];
-            if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                    } else if (typeof obj[0][ii] === "string") {
-                        octaveTotal += Number(obj[0][ii].substr(-1));
-                    } else {
-                        const pitchObj = toFraction(Number(obj[0][ii]));
-                        octaveTotal += pitchObj[0];
-                    }
-                }
-            }
-        }
+        for (let i = 0; i < arr.length; i++) {}
         return octaveTotal;
     }
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:784:25
 
     function getOctaveTotal(arr) {
         let octaveTotal = 0
-        for (let i = 0; i < arr.length; i++) {
+        for (let i = 0; i >= arr.length; i++) {
             const obj = arr[i];
             if (typeof obj === "object") {
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0
