[Killed] BlockStatement
Harish/testing/src/lilypond.js:786:42
         let octaveTotal = 0
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
-            if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                    } else if (typeof obj[0][ii] === "string") {
-                        octaveTotal += Number(obj[0][ii].substr(-1));
-                    } else {
-                        const pitchObj = toFraction(Number(obj[0][ii]));
-                        octaveTotal += pitchObj[0];
-                    }
-                }
-            }
+            if (typeof obj === "object") {}
         }
         return octaveTotal;
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:786:17
         let octaveTotal = 0
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
-            if (typeof obj === "object") {
+            if (true) {
                 for (let ii = 0; ii < obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:787:34
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
             if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
+                for (let ii = 0; ii <= obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
                     } else if (typeof obj[0][ii] === "string") {
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 10

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:788:25
             const obj = arr[i];
             if (typeof obj === "object") {
                 for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
+                    if (false) {
                     } else if (typeof obj[0][ii] === "string") {
                         octaveTotal += Number(obj[0][ii].substr(-1));
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: NaN

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:788:25
             const obj = arr[i];
             if (typeof obj === "object") {
                 for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
+                    if (obj[0][ii] !== "R") {
                     } else if (typeof obj[0][ii] === "string") {
                         octaveTotal += Number(obj[0][ii].substr(-1));
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:789:32
             if (typeof obj === "object") {
                 for (let ii = 0; ii < obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
-                    } else if (typeof obj[0][ii] === "string") {
+                    } else if (typeof obj[0][ii] !== "string") {
                         octaveTotal += Number(obj[0][ii].substr(-1));
                     } else {
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 48

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:789:32
             if (typeof obj === "object") {
                 for (let ii = 0; ii < obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
-                    } else if (typeof obj[0][ii] === "string") {
+                    } else if (false) {
                         octaveTotal += Number(obj[0][ii].substr(-1));
                     } else {
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 48

[Killed] BlockStatement
Harish/testing/src/lilypond.js:791:28
                     if (obj[0][ii] === "R") {
                     } else if (typeof obj[0][ii] === "string") {
                         octaveTotal += Number(obj[0][ii].substr(-1));
-                    } else {
-                        const pitchObj = toFraction(Number(obj[0][ii]));
-                        octaveTotal += pitchObj[0];
-                    }
+                    } else {}
                 }
             }
killedBy: getOctaveTotal gives the octave total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
Harish/testing/src/lilypond.js:805:32
         return a + b;
     }
 
-    function getNoteCount(arr) {
-        let noteCount = 0
-        for (let i = 0; i < arr.length; i++) {
-            const obj = arr[i];
-            if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                        continue;
-                    }
-                    noteCount = add(1, noteCount);
-                }
-            }
-        }
-        return noteCount;
-    }
+    function getNoteCount(arr) {}
 
     function getDrum() {
killedBy: getNoteCount calculates the note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:807:25
 
     function getNoteCount(arr) {
         let noteCount = 0
-        for (let i = 0; i < arr.length; i++) {
+        for (let i = 0; false; i++) {
             const obj = arr[i];
             if (typeof obj === "object") {
killedBy: getNoteCount calculates the note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
Harish/testing/src/lilypond.js:807:46
 
     function getNoteCount(arr) {
         let noteCount = 0
-        for (let i = 0; i < arr.length; i++) {
-            const obj = arr[i];
-            if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                        continue;
-                    }
-                    noteCount = add(1, noteCount);
-                }
-            }
-        }
+        for (let i = 0; i < arr.length; i++) {}
         return noteCount;
     }
killedBy: getNoteCount calculates the note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:809:17
         let noteCount = 0
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
-            if (typeof obj === "object") {
+            if (typeof obj !== "object") {
                 for (let ii = 0; ii < obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:810:34
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
             if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
+                for (let ii = 0; ii >= obj[0].length; ii++) {
                     if (obj[0][ii] === "R") {
                         continue;
killedBy: getNoteCount calculates the note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
Harish/testing/src/lilypond.js:810:60
         for (let i = 0; i < arr.length; i++) {
             const obj = arr[i];
             if (typeof obj === "object") {
-                for (let ii = 0; ii < obj[0].length; ii++) {
-                    if (obj[0][ii] === "R") {
-                        continue;
-                    }
-                    noteCount = add(1, noteCount);
-                }
+                for (let ii = 0; ii < obj[0].length; ii++) {}
             }
         }
killedBy: getNoteCount calculates the note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
Harish/testing/src/lilypond.js:821:24
         return noteCount;
     }
 
-    function getDrum() {
-        return "drum"
-    }
+    function getDrum() {}
 
     const saveLilypondOutput = function (activity, instrumentName=getEmptyString(), temp_arr=get_temparr(), arr=getArr(), startDrums=0, turtleCount=0) {
killedBy: getDrum returns drum
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "drum"
Received: undefined

[Killed] ArrayDeclaration
Harish/testing/src/lilypond.js:850:29
         
         let occupiedShortNames = getEmptyList();
         // for (const t in activity.logo.notation.notationStaging) {
-            for (const t in [0,1,2,3,4]) {
+            for (const t in []) {
             // console.debug('value of t: ' + t);
             let tNumber = funcNum(t);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\new DrumStaff \\with {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)··
\\score {
   <<·

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:853:17
             for (const t in [0,1,2,3,4]) {
             // console.debug('value of t: ' + t);
             let tNumber = funcNum(t);
-            if (temp_arr[t].length > 0) {
+            if (false) {
                 let octaveTotal = 0;
                 let noteCount = 0;
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\new DrumStaff \\with {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)··
\\score {
   <<

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:853:17
             for (const t in [0,1,2,3,4]) {
             // console.debug('value of t: ' + t);
             let tNumber = funcNum(t);
-            if (temp_arr[t].length > 0) {
+            if (temp_arr[t].length <= 0) {
                 let octaveTotal = 0;
                 let noteCount = 0;
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\new DrumStaff \\with {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)··
\\score {
   <<

[Killed] BlockStatement
Harish/testing/src/lilypond.js:867:56
                 // let instrumentName = "";
                 let shortInstrumentName = getEmptyString()
 
-                if (greaterThan(tNumber,startDrums-1)) {
-                    instrumentName = getDrum();
-                    instrumentName = replace_instr(instrumentName);
-                    activity.logo.notationOutput += instrumentName + " = {\n";
-                    activity.logo.notationOutput += "\\drummode {\n";
-                    activity.logo.notationOutput += activity.logo.notationNotes[t];
-                    // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
-                        activity.logo.notationOutput += ' \\bar "|."';
-                    }
-
-                    activity.logo.notationOutput += "\n}\n";
-                    activity.logo.notationOutput += "\n}\n\n";
-                } else {
+                if (greaterThan(tNumber,startDrums-1)) {} else {
                     // if (t in arr) {
                     //     // const turtleNumber = tNumber;
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\drummode {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
Voice = \\new DrumStaff \\with {
   \\clef \"percussion\"

[Killed] ArithmeticOperator
Harish/testing/src/lilypond.js:867:41
                 // let instrumentName = "";
                 let shortInstrumentName = getEmptyString()
 
-                if (greaterThan(tNumber,startDrums-1)) {
+                if (greaterThan(tNumber,startDrums + 1)) {
                     instrumentName = getDrum();
                     instrumentName = replace_instr(instrumentName);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 24

[Killed] StringLiteral
Harish/testing/src/lilypond.js:870:70
                 if (greaterThan(tNumber,startDrums-1)) {
                     instrumentName = getDrum();
                     instrumentName = replace_instr(instrumentName);
-                    activity.logo.notationOutput += instrumentName + " = {\n";
+                    activity.logo.notationOutput += instrumentName + "";
                     activity.logo.notationOutput += "\\drummode {\n";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:874:25
                     activity.logo.notationOutput += "\\drummode {\n";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
                     // Add bar to last turtle's output.
-                    if (c === turtleCount - 1) {
+                    if (true) {
                         activity.logo.notationOutput += ' \\bar "|."';
                     }
killedBy: saveLilypondOutput when argument contains / and .
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "."
Received string:        "um = {
\\drummode {
\\meter
 \\bar \"|.\"
}

[Survived] StringLiteral
Harish/testing/src/lilypond.js:878:53
                         activity.logo.notationOutput += ' \\bar "|."';
                     }
 
-                    activity.logo.notationOutput += "\n}\n";
+                    activity.logo.notationOutput += "";
                     activity.logo.notationOutput += "\n}\n\n";
                 } else {

[Killed] StringLiteral
Harish/testing/src/lilypond.js:891:70
                     instrumentName = instrument(t, arr, activity, clef, startDrums, getStringArr())
 
                     // console.log("L604: " + instrumentName);
-                    activity.logo.notationOutput += instrumentName + " = {\n";
+                    activity.logo.notationOutput += instrumentName + "";
                     activity.logo.notationOutput += activity.logo.notationNotes[t];
 
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Survived] StringLiteral
Harish/testing/src/lilypond.js:953:81
                     // console.debug("shortInstrumentName: " + shortInstrumentName);
                 }
 
-                activity.logo.notationOutput += replace_instr(instrumentName) + "Voice = ";
+                activity.logo.notationOutput += replace_instr(instrumentName) + "";
                 if (greaterThan(tNumber,startDrums-1)) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:954:21
                 }
 
                 activity.logo.notationOutput += replace_instr(instrumentName) + "Voice = ";
-                if (greaterThan(tNumber,startDrums-1)) {
+                if (false) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";
                 } else {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\new DrumStaff \\with {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:954:21
                 }
 
                 activity.logo.notationOutput += replace_instr(instrumentName) + "Voice = ";
-                if (greaterThan(tNumber,startDrums-1)) {
+                if (true) {
                     activity.logo.notationOutput += "\\new DrumStaff \\with {\n";
                 } else {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\new Staff \\with {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] StringLiteral
Harish/testing/src/lilypond.js:959:49
                 } else {
                     activity.logo.notationOutput += "\\new Staff \\with {\n";
                 }
-                activity.logo.notationOutput += '   \\clef "' + clef[0] + '"\n';
+                activity.logo.notationOutput += "" + clef[0] + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
                 if (greaterThan(tNumber,startDrums-1)) {
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "clef \"treble\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:961:56
                 }
                 activity.logo.notationOutput += '   \\clef "' + clef[0] + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
-                if (greaterThan(tNumber,startDrums-1)) {
-                    const num = tNumber - startDrums;
-                    // console.debug("shortInstrumentName = d" + num);
-                    activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';
-                    activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
-                } else {
+                if (greaterThan(tNumber,startDrums-1)) {} else {
                     activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
                     activity.logo.notationOutput += '   midiInstrument = "acoustic grand"\n';
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"d4\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:961:21
                 }
                 activity.logo.notationOutput += '   \\clef "' + clef[0] + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
-                if (greaterThan(tNumber,startDrums-1)) {
+                if (false) {
                     const num = tNumber - startDrums;
                     // console.debug("shortInstrumentName = d" + num);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"d4\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Survived] ArithmeticOperator
Harish/testing/src/lilypond.js:962:33
                 activity.logo.notationOutput += '   \\clef "' + clef[0] + '"\n';
                 activity.logo.notationOutput += '   instrumentName = "' + instrumentName + '"\n';
                 if (greaterThan(tNumber,startDrums-1)) {
-                    const num = tNumber - startDrums;
+                    const num = tNumber + startDrums;
                     // console.debug("shortInstrumentName = d" + num);
                     activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';

[Killed] StringLiteral
Harish/testing/src/lilypond.js:965:53
                     const num = tNumber - startDrums;
                     // console.debug("shortInstrumentName = d" + num);
                     activity.logo.notationOutput += '   shortInstrumentName = "' + "d" + num + '"\n';
-                    activity.logo.notationOutput += '   midiInstrument = "snare drum"\n';
+                    activity.logo.notationOutput += "";
                 } else {
                     activity.logo.notationOutput += '   shortInstrumentName = "' + shortInstrumentName + '"\n';
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   midiInstrument = \"snare drum\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] StringLiteral
Harish/testing/src/lilypond.js:976:21
                 activity.logo.notationOutput +=
                     '\n} { \\clef "' +
                     clef[0] +
-                    '" \\' +
+                    "" +
                     replace_instr(instrumentName) +
                     " }\n\n";
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:979:20
                     '" \\' +
                     replace_instr(instrumentName) +
                     " }\n\n";
-            } else {
-                clef = findClef(clef, flag=false);
-            }
+            } else {}
 
             c = add(c, 1);

[NoCoverage] BooleanLiteral
Harish/testing/src/lilypond.js:980:44
                     replace_instr(instrumentName) +
                     " }\n\n";
             } else {
-                clef = findClef(clef, flag=false);
+                clef = findClef(clef, flag=true);
             }
 

[Killed] StringLiteral
Harish/testing/src/lilypond.js:987:41
         }
 
         // Begin the SCORE section.
-        activity.logo.notationOutput += "\n\\score {\n";
+        activity.logo.notationOutput += "";
         activity.logo.notationOutput += "   <<\n";
         instrumentName = computeInstrument(activity, clef, startDrums, getStringArr())
killedBy: saveLilypondOutput when argument contains / and .
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "
\\score {
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1016:71
 // }
 // module.exports = Lily
 // module.exports = LILYPONDHEADER
-function short(part1, part2, occupiedShortNames, shortInstrumentName) {
-    final = add(part1, part2);
-    if (occupiedShortNames.indexOf(final) === -1) {
-        // found unique shortname
-        shortInstrumentName = final;
-    } else {
-        final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
-            // found unique shortname
-            shortInstrumentName = final;
-        }
-    }
-    return shortInstrumentName;
-}
+function short(part1, part2, occupiedShortNames, shortInstrumentName) {}
 
 function occupied(part1, part2, occupiedShortNames, shortInstrumentName, t) {
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: undefined

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:1018:9
 // module.exports = LILYPONDHEADER
 function short(part1, part2, occupiedShortNames, shortInstrumentName) {
     final = add(part1, part2);
-    if (occupiedShortNames.indexOf(final) === -1) {
+    if (false) {
         // found unique shortname
         shortInstrumentName = final;
killedBy: occupied and short gives the occupiedShortNames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:1018:9
 // module.exports = LILYPONDHEADER
 function short(part1, part2, occupiedShortNames, shortInstrumentName) {
     final = add(part1, part2);
-    if (occupiedShortNames.indexOf(final) === -1) {
+    if (occupiedShortNames.indexOf(final) !== -1) {
         // found unique shortname
         shortInstrumentName = final;
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: "a"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1021:12
     if (occupiedShortNames.indexOf(final) === -1) {
         // found unique shortname
         shortInstrumentName = final;
-    } else {
-        final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
-            // found unique shortname
-            shortInstrumentName = final;
-        }
-    }
+    } else {}
     return shortInstrumentName;
 }
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: "ab_"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1023:55
         shortInstrumentName = final;
     } else {
         final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
-            // found unique shortname
-            shortInstrumentName = final;
-        }
+        if (occupiedShortNames.indexOf(final) === -1) {}
     }
     return shortInstrumentName;
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: "ab_"

[Killed] UnaryOperator
Harish/testing/src/lilypond.js:1023:51
         shortInstrumentName = final;
     } else {
         final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
+        if (occupiedShortNames.indexOf(final) === +1) {
             // found unique shortname
             shortInstrumentName = final;
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: "ab_"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1031:77
     return shortInstrumentName;
 }
 
-function occupied(part1, part2, occupiedShortNames, shortInstrumentName, t) {
-    final = add(part1, part2);
-    if (occupiedShortNames.indexOf(final) === -1) {
-        occupiedShortNames[t] = shortInstrumentName;
-    } else {
-        final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
-            occupiedShortNames[t] = shortInstrumentName;
-        }
-    }
-    return occupiedShortNames;
-}
+function occupied(part1, part2, occupiedShortNames, shortInstrumentName, t) {}
 
 function shortNames(instrumentName, occupiedShortNames, shortInstrumentName, t) {
killedBy: occupied and short gives the occupiedShortNames
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [, , "dr"]
Received: undefined

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1033:51
 
 function occupied(part1, part2, occupiedShortNames, shortInstrumentName, t) {
     final = add(part1, part2);
-    if (occupiedShortNames.indexOf(final) === -1) {
-        occupiedShortNames[t] = shortInstrumentName;
-    } else {
+    if (occupiedShortNames.indexOf(final) === -1) {} else {
         final = add(final, final);
         if (occupiedShortNames.indexOf(final) === -1) {
killedBy: occupied and short gives the occupiedShortNames
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   undefined,
-   undefined,
