[Killed] BlockStatement
Harish/testing/src/lilypond.js:1035:12
     final = add(part1, part2);
     if (occupiedShortNames.indexOf(final) === -1) {
         occupiedShortNames[t] = shortInstrumentName;
-    } else {
-        final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
-            occupiedShortNames[t] = shortInstrumentName;
-        }
-    }
+    } else {}
     return occupiedShortNames;
 }
killedBy: occupied and short gives the occupiedShortNames
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
    4,

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:1037:13
         occupiedShortNames[t] = shortInstrumentName;
     } else {
         final = add(final, final);
-        if (occupiedShortNames.indexOf(final) === -1) {
+        if (occupiedShortNames.indexOf(final) !== -1) {
             occupiedShortNames[t] = shortInstrumentName;
         }
killedBy: occupied and short gives the occupiedShortNames
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
    4,

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1052:38
     let part2 = retEmpty();
     let done = 0;
     const n = instrumentName.indexOf("_");
-    if (instrumentName.length === 1) {
-        shortInstrumentName = instrumentName;
-        occupiedShortNames[t] = shortInstrumentName;
-    } else if (n === -1) {
+    if (instrumentName.length === 1) {} else if (n === -1) {
         // no space in instrument name
         for (let p = 2; p < instrumentName.length; p++) {
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "hi"

[Killed] EqualityOperator
Harish/testing/src/lilypond.js:1052:9
     let part2 = retEmpty();
     let done = 0;
     const n = instrumentName.indexOf("_");
-    if (instrumentName.length === 1) {
+    if (instrumentName.length !== 1) {
         shortInstrumentName = instrumentName;
         occupiedShortNames[t] = shortInstrumentName;
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "hi"

[Killed] UnaryOperator
Harish/testing/src/lilypond.js:1055:22
     if (instrumentName.length === 1) {
         shortInstrumentName = instrumentName;
         occupiedShortNames[t] = shortInstrumentName;
-    } else if (n === -1) {
+    } else if (n === +1) {
         // no space in instrument name
         for (let p = 2; p < instrumentName.length; p++) {
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hi"
Received: "aa"

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1055:26
     if (instrumentName.length === 1) {
         shortInstrumentName = instrumentName;
         occupiedShortNames[t] = shortInstrumentName;
-    } else if (n === -1) {
-        // no space in instrument name
-        for (let p = 2; p < instrumentName.length; p++) {
-            if (p === 2) {
-                final = instrumentName.slice(0, 2);
-            } else {
-                final = add(final, instrumentName.charAt(p - 1));
-            }
-
-            if (occupiedShortNames.indexOf(final) === -1) {
-                // not found in array so unique shortname
-                shortInstrumentName = final;
-                occupiedShortNames[t] = shortInstrumentName;
-                break;
-            }
-        }
-    } else {
+    } else if (n === -1) {} else {
         // at least 1 space in instrument name
         firstPart = instrumentName.slice(0, n);
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1058:26
     } else if (n === -1) {
         // no space in instrument name
         for (let p = 2; p < instrumentName.length; p++) {
-            if (p === 2) {
-                final = instrumentName.slice(0, 2);
-            } else {
+            if (p === 2) {} else {
                 final = add(final, instrumentName.charAt(p - 1));
             }
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: TypeError: Cannot read property 'indexOf' of undefined

[NoCoverage] BlockStatement
Harish/testing/src/lilypond.js:1060:20
         for (let p = 2; p < instrumentName.length; p++) {
             if (p === 2) {
                 final = instrumentName.slice(0, 2);
-            } else {
-                final = add(final, instrumentName.charAt(p - 1));
-            }
+            } else {}
 
             if (occupiedShortNames.indexOf(final) === -1) {

[NoCoverage] ArithmeticOperator
Harish/testing/src/lilypond.js:1061:58
             if (p === 2) {
                 final = instrumentName.slice(0, 2);
             } else {
-                final = add(final, instrumentName.charAt(p - 1));
+                final = add(final, instrumentName.charAt(p + 1));
             }
 

[Killed] ConditionalExpression
Harish/testing/src/lilypond.js:1064:17
                 final = add(final, instrumentName.charAt(p - 1));
             }
 
-            if (occupiedShortNames.indexOf(final) === -1) {
+            if (false) {
                 // not found in array so unique shortname
                 shortInstrumentName = final;
killedBy: saveLilypondOutput should correctly update notionOutput
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "   shortInstrumentName = \"h\"
"
Received string:    "% You can change the MIDI instruments below to anything on this list:
% (http://lilypond.org/doc/v2.18/documentation/notation/midi-instruments)·
drum = {
\\drummode {

[Killed] BlockStatement
Harish/testing/src/lilypond.js:1071:12
                 break;
             }
         }
-    } else {
-        // at least 1 space in instrument name
-        firstPart = instrumentName.slice(0, n);
-        secondPart = instrumentName.slice(add(n, 1), instrumentName.length);
-        part1 = firstPart.charAt(0);
-        part2 = secondPart.charAt(0);
-
-        occupiedShortNames = occupied(part1, part2, instrumentName, occupiedShortNames, shortInstrumentName, t)
-        shortInstrumentName = short(part1, part2, instrumentName, occupiedShortNames, shortInstrumentName);
-    }
+    } else {}
     return (occupiedShortNames, shortInstrumentName)
 }
killedBy: shortNames should correctly update shortnames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aa"
Received: "hi"
